Documents/Выдача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Выдача</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыЗаказа</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Выдача/Ext/ManagerModule.bsl
// Возвращает выборку уникальных заказов в документе
Функция ВыбратьЗаказы(Знач Ссылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Заказ КАК Заказ
	|ИЗ
	|	Документ.Выдача.Заказы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ВыдатьЗаказы(Знач КоллекцияЗаказов) Экспорт
	
	ДокументВыдачи = Документы.Выдача.СоздатьДокумент();
	ДокументВыдачи.УстановитьНовыйНомер();
	ДокументВыдачи.Дата = ТекущаяДатаСеанса();
	
	Для Каждого Заказ Из КоллекцияЗаказов Цикл
		ДокументВыдачи.Заказы.Добавить().Заказ = Заказ;
	КонецЦикла;	
	
	Попытка
		ДокументВыдачи.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ДокументВыдачи.Ссылка;
	
КонецФункции
